snlkuharlocal/src/InformationRegisters/ОтложенныеДвиженияДокументов/ОтложенныеДвиженияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтложенныеДвиженияДокументов</name>
  <resources>
    <name>Движения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>КоличествоЗаписей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Добавлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаВыполняется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокСсылка</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.УстановкаСтатусаКМ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ОтложенныеДвиженияДокументов/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ЗаписатьОтложенныеДвижения(Команда)
	сДокументы = Новый Соответствие;
	Для каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл	
		Если ЗначениеЗаполнено(СтрокаСписка.ДокСсылка) Тогда
			сДокументы[СтрокаСписка.ДокСсылка] = Истина;		
		КонецЕсли;		
	КонецЦикла;	  
	
	ЗаписатьОтложенныеДвижения_НаСервере(сДокументы);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОтложенныеДвижения_НаСервере(сДокументы)
	Для каждого КиЗ Из сДокументы Цикл	
		рЗаписи = РегистрыСведений.ОтложенныеДвиженияДокументов.ЗаписатьОтложенныеДвиженияДокумента(КиЗ.Ключ);
		Если рЗаписи.Успешно Тогда
			Сообщить("Успешно записаны движения документа: " + КиЗ.Ключ, СтатусСообщения.Информация);
		Иначе
			МаркировкаКС.ВывестиОшибки(рЗаписи);		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлагОшибки(Команда)
	сДокументы = Новый Соответствие;
	Для каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл	
		Если ЗначениеЗаполнено(СтрокаСписка.ДокСсылка) Тогда
			сДокументы[СтрокаСписка.ДокСсылка] = Истина;		
		КонецЕсли;		
	КонецЦикла;	  
	
	СнятьФлагОшибки_НаСервере(сДокументы);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СнятьФлагОшибки_НаСервере(сДокументы)
	Для каждого КиЗ Из сДокументы Цикл  
		ДокСсылка = КиЗ.Ключ;                          
		Если ЗначениеЗаполнено(ДокСсылка) Тогда
			НЗ = РегистрыСведений.ОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
			НЗ.Отбор.ДокСсылка.Установить(ДокСсылка, Истина);
			
			НЗ.Прочитать();
			
			Для каждого Запись Из НЗ Цикл
				Если Запись.ОшибкаОбработки Тогда
					Запись.ОшибкаОбработки = Ложь;									
				КонецЕсли;			
			КонецЦикла;
			
			Если НЗ.Модифицированность() Тогда
				НЗ.Записать();			
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры
